Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: མངོན་སུམ་དུ་བྱེད་པ་ཐ་དད་དུ་དམིགས་པར་འགྱུར་རོ་ཞེས་བྱ་བའོ།
en: The elder Śāriputra has said: if you have had such direct witness of those dharmas, in that case you would apprehend separately a witness, something being witnessed, and a witnessing.

source: །དེ་བས་ན་འཕགས་པ་བྱམས་པས་སླར་གསུངས་པ། ཆོས་དེ་དག་ཇི་ལྟར་བདག་སྨྲས་པ་དེ་ལྟར་ཆོས་དེ་དག་མངོན་སུམ་དུ་བྱས་པ་མེད་དོ་ཞེས་བྱ་བ་ནི།
en: Therefore, the noble Maitreya again says, “I do not directly witness those dharmas in the way I have explained them to be.”

source: མངོན་སུམ་དུ་བྱེད་པའི་དུས་ན། ཆོས་དེ་དག་དམིགས་སུ་མེད་དེ། དེ་དག་བརྗོད་དུ་ཡང་མེད་ན། ཇི་ལྟར་སྨྲ་བར་བྱ་ཞེས་བསྟན་པའོ།
en: This is teaching that when he directly witnesses those dharmas, they cannot be apprehended and are also inexpressible, so how is he going to speak about them?

source: །ཆོས་གང་གིས་དགྲ་བཅོམ་པར་བརྗོད་པའི་ཆོས་དེ་ཁྱོད་ཀྱིས་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངམ་ཞེས་བྱ་བ་ཞེས་གསུངས་པ་དང་།
en: The Lord says, “Do you see that dharma on account of which you come to be known as a worthy one?”

source: གནས་གྱུར་པ་མ་གཏོགས་པར་དགྲ་བཅོམ་པ་ཞེས་བྱ་བའི་ཆོས་གང་ཡང་མེད་དོ་སྙམ་ནས། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ་ཞེས་སླར་གསོལ་ཏོ།
en: Having in mind that apart from the transformation of the basis, a dharma that is a “worthy one” does not exist, Śāriputra again says, “Lord, I do not.”

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བགྱིད་ཅིང་ཞེས་ཞུས་པ་ཅི་ལས་དགོངས་ཤེ་ན།
en: What is the intention where Subhūti asks, “Lord, how do bodhisattva great beings complete the perfection of wisdom?”

source: གལ་ཏེ་ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་ན། གང་དག་གི་དོན་དུ་སུ་ཞིག་ཇི་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱེད་ཅེས་ཞུས་པའོ།
en: He is asking: “If all dharmas cannot be apprehended, who completes the perfection of wisdom in which way and for whose sake?”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་འཛིན་པའི་ཚེ། སྙིང་རྗེའི་དབང་གིས་ཀུན་རྫོབ་ཏུ་དམིགས་པ་དང་བཅས་པའི་འདུ་ཤེས་ཅན་དུ་འགྱུར་བར་བསྟན་ནས། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཐབས་རབ་ཏུ་དབྱེ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱོང་བ་དག་བསྟན་ཏེ།
en: Then the Lord, having taught that when assisting beings they become, governed by compassion, conventionally, those who have a perception with an objective support, delineates their methods to bring the six perfections to completion and teaches the purifications of a buddhafield.

source: དེ་དག་ཐམས་ཅད་ཀྱང་དོན་གསལ་བས་རྣམ་པར་མ་ཕྱེའོ།
en: I will not go into these because the meaning of them all is clear.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་འདི་དག་ཐམས་ཅད་ཀྱང་ཐམས་ཅད་ལ་ཡོད་པ་ནི་མ་ཡིན་གྱི།
en: It is not that all bodhisattvas make all these prayers that are vows.

source: སོ་སོའི་བསམ་པ་ཐ་དད་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྨོན་ལམ་དག་འབྱུང་སྟེ།
en: The prayers that are vows come about in harmony with each of their individual different aspirations.

source: ཁ་ཅིག་ནི་རྣམ་པ་ཐམས་ཅད་དུ་སྨོན་ལམ་བཏབ་ཀྱང་། ཕྱིས་སེམས་ཅན་རྣམས་ཀྱི་ལས་ཀྱི་དབང་གིས་ཅུང་ཟད་མི་འགྲུབ་པ་ཡང་ཡོད་དོ།
en: It could be that some have fully made a prayer that is a vow but later, because of the force of the beings’ karma, a bit of it might not be accomplished.

source: །གང་གཱའི་ལྷ་མོ་ལུང་བསྟན་པ་ཡང་གོ་སླའོ།
en: The prophesy of Gaṅgadevī is also easy to understand.

source: །དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱིས་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་སྒོམ་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་སྒོམ་པ་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་རྣམ་པར་གྲོལ་བ་སྤངས་ཏེ། བསྒོམ་པ་ཞེས་བྱ་བ་ཞུས་པའོ།
en: Fully mastering emptiness Then the elder Subhūti asks how a bodhisattva cultivates the three gateways to liberation and cultivates the thirty-seven dharmas on the side of awakening while rejecting the freedom of śrāvakas and pratyekabuddhas.

source: །དེའི་འོག་ཏུ་བཤད་པའི་འགྲེས་ནི་སྟོང་པ་ཞེས་བྱ་བར་སོ་སོར་བརྟག་པར་བྱའོ་ཞེས་བྱའོ།
en: The explanatory section following that says they “should understand analytically ‘…empty.’ ”

source: །སྟོང་པ་ཉིད་ཀྱི་ལྷག་མཐོང་མངོན་པར་འཕེལ་བའི་དུས་ན་ནི་ཅི་ནས་ཀྱང་དེ་ལྟར་སོ་སོར་བརྟགས་ནས། སེམས་གཡེང་བར་མི་འགྱུར་བ་དེ་ལྟར་སོ་སོར་བརྟག་པར་བྱ་སྟེ་ཞེས་བྱའོ།
en: At the time special insight into emptiness is increasing, “one way or the other, when they understand this analytically, such an analytical understanding should be without mental distraction.”

source: །སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་དུས་ན་ནི་སེམས་མི་གཡེང་བ་དང་ལྡན་པས་ཆོས་གང་མངོན་སུམ་དུ་བྱ་བའི་ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ་ཞེས་བྱའོ། །དེ་བཞིན་ཉིད་ཐོབ་པའི་དུས་ན་ནི་དེས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས་མངོན་སུམ་དུ་མི་བྱེད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ནས་ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན་པར་མཐོང་ངོ་ཞེས་བྱ་བའི་མཐའ་ལ་ཐུག་པའི་བར་གྱི་གཞུང་གིས་བསྟན་ཏེ། དམིགས་པར་བྱ་བ་དང་།
en: At the time of the meditative stabilization on emptiness, “without mental distraction they do not see the phenomenon that is the phenomenon to be actualized, and,” as for the time when they reach suchness, “not seeing that phenomenon they do not actualize it,” and so on, up to “they see [they]… are not joined and are not disjoined.”

source: དམིགས་པར་བྱེད་པ་མཉམ་པས་མཉམ་པ་རྣམ་པར་མི་རྟོག་པ་ཉིད་དུ་བསྟན་པའོ།
en: That is what that the text teaches, that something apprehended and something that apprehends are equally the same and cannot be conceived of.

source: །དེས་ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས་མངོན་སུམ་དུ་མི་བྱེད་དོ་ཞེས་བྱ་བ་ནི།
en: Hence, “not seeing that phenomenon they do not actualize it.”

source: ཆོས་མ་མཐོང་བ་ཉིད། དེའི་མངོན་སུམ་དུ་མི་བྱེད་པའི་རྒྱུའོ།
en: Just not seeing a phenomenon is the cause of not actualizing it.

source: །གལ་ཏེ་མཐོང་ན་དེ་ལྟ་ན་ནི་མངོན་སུམ་དུ་བྱེད་དོ།
en: Were they to see it they would actualize it.

source: །འོ་ན་མངོན་སུམ་བྱས་ན་ཉེས་པ་ཅིར་འགྱུར་ཞེ་ན།
en: And what would the fault be were they to have actualized it?

source: དེས་ཉན་ཐོས་ལྟར་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་བྱས་པར་འགྱུར་རོ།
en: They would have actualized the very limit of reality just like a śrāvaka does.

source: །དེ་ལྟ་ན་ནི་དེའི་རྣམ་པར་གྲོལ་བ་ལ་སྦྱོར་བར་ཡང་འགྱུར་རོ།
en: And in that case they would connect with their liberation. “

source: །ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོང་པ་ཉིད་ལ་གནས་ལ་སྟོང་པ་ཉིད་མངོན་སུམ་དུ་ཡང་མི་བགྱིད་པ་ལགས་ཞེས་བྱ་བ་ལ།
en: How do bodhisattva great beings stand in emptiness but not actualize emptiness?”

source: སྟོང་པ་ཉིད་ནི་ཆོས་གང་མངོན་སུམ་དུ་བྱ་བ་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཞེས་བྱ་བའི་གནས་སུ་བསྟན་ཏོ།
en: This teaches that emptiness, “the phenomenon that is… to be actualized” that “they do not see,” is where they stand.

source: །ཡང་ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས་མངོན་སུམ་དུ་མི་བྱེད་དོ་ཞེས་བྱ་བ་ནི་སྟོང་པ་ཉིད་མངོན་སུམ་དུ་མི་བྱེད་པ་བསྟན་ཏོ།
en: Again, “not seeing that phenomenon they do not actualize it” teaches they do not actualize emptiness.

source: །དེ་ལ་གནས་ཀྱང་དེ་མངོན་སུམ་དུ་ཡང་མི་བྱེད་ཅེས་བྱ་བ་འདི་ཇི་ལྟར་ཤེས་པར་རུང་ཞེས་ཞུས་པ་དང་།
en: This “stand… but not actualize” is asking “how could it be known?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ་སྔ་མའི་དབང་གིས་འགྱུར་བ་བསྟན་པ། རབ་འབྱོར་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའི་སྟོང་པ་ཉིད་ལ་སོ་སོར་རྟོག་པ་ན་མངོན་སུམ་དུ་སོ་སོར་མི་རྟོག་གོ་ཞེས་བྱ་བ་སྟེ།
en: The Lord, based on the prior intention, teaches a modification: “Subhūti, when bodhisattva great beings contemplate emptiness furnished with the best of all aspects, they do not contemplate that they should actualize it.”

source: སྟོང་པ་ཉིད་བསྒོམ་པར་བྱའོ་ཞེས་བྱ་བ་ནི་དགོངས་པ་སྔ་མ་ཉིད་ཀྱིས། ཉན་ཐོས་འགོག་པ་མངོན་སུམ་དུ་བྱའོ་སྙམ་པའི་བསམ་པ་ལྟ་བུར། སྟོང་པ་ཉིད་མངོན་སུམ་དུ་བྱའོ་སྙམ་པའི་དགོངས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་མི་མངའ་སྟེ།
en: With just the earlier intention, “I should meditate on emptiness,” those bodhisattvas do not have the intention “I will actualize emptiness,” like śrāvakas thinking “I will actualize the cessation.”

source: སྟོང་པ་ཉིད་བསྒོམ་པར་བྱའོ་སྙམ་པ་ནི་རབ་ཏུ་མཐུན་པར་བྱའོ་སྙམ་དུ་དགོངས་པ་ཉིད་ཡིན་ནོ།
en: The thought “I will meditate on emptiness” is just the intention “I will totally harmonize with it.”

source: །དེ་བས་ན་ཕྱིས་ཀྱང་བསྒོམ་པ་འབའ་ཞིག་ཡིན་གྱི་མངོན་སུམ་དུ་བྱེད་པ་ནི་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Therefore, this means that even later on it is only a meditation, it is not an actualization.

source: །དེ་བས་ན་འདི་ནི་ཡོངས་སུ་འདྲིས་པར་བྱ་བའི་དུས་ཡིན་གྱི་འདི་ནི་མངོན་སུམ་དུ་བྱ་བའི་དུས་མ་ཡིན་ནོ་ཞེས་བྱ་བར་རྟོག་གོ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: Therefore, it says “they contemplate that it is not the time it should be actualized, but rather it is the time it should be mastered.”

source: གང་སྟོང་པ་ཉིད་ལ་ཡོངས་སུ་འདྲིས་པར་ཡང་བྱེད་ལ། མངོན་སུམ་དུ་ཡང་མི་བྱེད་པ་དེ་ནི་ཡོངས་སུ་འདྲིས་པའི་ཤེས་པ་ཉིད་ཀྱི་མཐུ་ཡིན་ནོ།
en: The mastering of emptiness without also actualizing it is the power of knowledge of mastery. “

source: །མཉམ་པར་མ་བཞག་པ་ཉིད་དུ་སེམས་དམིགས་ལ་འདོགས་ཏེ་ཞེས་བྱ་བ་ནི་ཡོངས་སུ་འདྲིས་པའི་ཤེས་པ་ཞེས་བྱ་བ་རང་བཞིན་གྱི་སེམས་ཡིན་གྱི། དེ་མཉམ་པར་བཞག་པ་ནི་མ་ཡིན་ཏེ།
en: When not in actual meditative equipoise… [they] attach their minds to an objective support” is teaching that “knowledge of mastery” is mind in its ordinary state, it is not meditative equipoise.

source: དེ་བས་ན་སྐད་ཅིག་དེའི་ཚེ་ཞི་གནས་ནི་མེད་དོ། །ཞི་གནས་མེད་པས་འཇིག་རྟེན་ལས་འདས་པའི་ལམ་མི་འབྱུང་ངོ་ཞེས་སྟོན་ཏོ།
en: Therefore, in that instant there is no calm abiding, and because there is no calm abiding the extraordinary path does not arise.

source: །ད་ནི་ཡོངས་སུ་འདྲིས་པའི་ཤེས་པ། དུས་དང་དུས་མ་ཡིན་པ་ཤེས་པ་སྟོན་ཏེ་འདི་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དུས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པའོ།
en: Now, teaching that knowledge of mastery is the knowledge of when is and is not the time, it says “it is the time for the perfection of giving,” and so on.

source: །སྐྱེས་བུ་དཔའ་བོའི་དཔེ་དང་། བྱའི་དཔེ་དང་། འཕོང་གི་སློབ་དཔོན་གྱི་དཔེ་དག་ཀྱང་གཞུང་དང་སྦྱར་ཏེ་གཟུང་བར་བྱའོ།
en: Understand the heroic person illustration, bird illustration, and master archer illustration from the text. “

source: །བཅོམ་ལྡན་འདས་ངོ་མཚར་ཏོ།
en: Lord, it is amazing!

source: །བདེ་བར་གཤེགས་པ་ངོ་མཚར་ཏོ་ཞེས་བྱ་བ་ནི་དེ་ལྟར་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དུ་མཐོང་བ་རྣམས་པར་མ་དོར་སེམས་ཞུམ་པའི་རྒྱུས། ཏིང་ངེ་འཛིན་གསུམ་བསྒོམ་ཞིང་ཉན་ཐོས་དང་རང་བྱང་ཆུབ་ཏུ་ལྟུང་བར་མ་གྱུར་པ་སྟེ། ངོ་མཚར་ཆེའོ་ཞེས་གསོལ་པའོ།
en: Sugata, it is amazing!” is saying “it is amazing” that those seeing all dharmas as emptiness have not, in the interim,feeling intimidated, fallen to a śrāvaka or pratyekabuddha awakening that is caused by meditation on the three meditative stabilizations.

source: །རབ་འབྱོར་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མ་བཏང་སྟེ་ཞེས་བྱ་བ་ལ་སོགས་པས། བཅོམ་ལྡན་འདས་ཀྱིས་འདིར་སེམས་ཞུམ་པར་མི་འགྱུར་བའི་རྒྱུ་སྟོན་ཏོ།
en: Here the Lord, with, “Subhūti, it is because the bodhisattva great beings do not forsake all beings,” and so on, teaches the cause of not feeling intimidated.

source: །འདི་ལ་ཡང་འགྲེས་བདུན་ཏེ། དམ་པ་མ་ཡིན་པའི་ཆོས་ལ་འཇུག་པའི་འགྲེས་དང་། དམིགས་པར་ལྟ་བའི་འགྲེས་དང་། སེམས་ཕྱིན་ཅི་ལོག་གི་འགྲེས་དང་། གང་ཟག་དང་ཆོས་སུ་རྣམ་པར་རྟོག་པའི་འགྲེས་དང་། མཚན་མའི་འགྲེས་དང་། སྨོན་ལམ་གྱི་འགྲེས་དང་།
en: Here there are a further seven subsections to the passage: the section about engaging with doctrines that are not good; the section about views with a false apprehension of facts; the section about distorted minds; the section about the conceptualization of a self and dharmas; the section about causal signs; the section about the fault of making wishes; and the section on questioning bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་དྲི་བའི་འགྲེས་སོ། །དེ་ལ་སེམས་ཅན་འདི་དག་ནི་དམ་པ་མ་ཡིན་པའི་ཆོས་ལ་དམ་པར་འདུ་ཤེས་པས་བསླུས་པར་གྱུར་པ་དག་སྟེ།
en: Among these, the first section is “I will not forsake these ignorant beings, these beings who are deceived because they perceive doctrines that are not good as good.”

source: བདག་གིས་སེམས་ཅན་མི་ཤེས་པ་དེ་དག་ཡོངས་སུ་གཏང་བར་མི་བྱའོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་དག་གིས་སྙིང་རྗེ་མངོན་པར་བསྐྱེད་དེ། སེམས་ཅན་ཐམས་ཅད་མི་གཏོང་བར་ཡིད་ལ་བྱེད་པའི་རྒྱུས།
en: Bodhisattvas generate compassion and are attentive to not forsaking beings, and that causes them, in the interim, not to feel cowed and not to actualize the very limit of reality.

source: བར་མ་དོར་ཞུམ་པར་མི་འགྱུར་ཞིང་། ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་མི་བྱེད་པ་ནི་འགྲེས་དང་པོའོ། །སེམས་ཅན་འདི་དག་ནི་ཡུན་རིང་པོ་ནས་བདག་དང་། སེམས་ཅན་ལ་སོགས་པར་དམིགས་པར་ལྟ་བར་སྤྱོད་སྤྱོད་པ་དག་སྟེ། དེ་དག་གི་ལྟ་བ་དེ་བདག་གིས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཆོས་བཤད་པས་སྤང་བར་བྱའོ་སྙམ་དུ་སེམས་བསྐྱེད་པའི་དབང་གིས་ཞུམ་པར་མི་འགྱུར་བ་ནི་འགྲེས་གཉིས་པའོ།
en: The second subsection is where they do not feel cowed based on the power of generating the thought, “These beings have… for a long time been practicing a practice with a false apprehension of facts while viewing… a self… a being and so on, so I will fully awaken to unsurpassed, perfect, complete awakening and teach them the doctrines in order to eliminate their views.”

source: །སེམས་ཅན་འདི་དག་ནི་ཡུན་རིང་པོ་ནས་རྟག་པ་དང་། བདེ་བ་དང་སྡུག་པ་དང་། བདག་ཏུ་འདུ་ཤེས་པས་ཕྱིན་ཅི་ལོག་རྣམ་པ་བཞིས་སེམས་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པ་དག་སྟེ། བདག་གིས་དེ་དག་དེ་ལས་བཟློག་པར་བྱའོ་ཞེས་བྱ་བ་ནི་འགྲེས་གསུམ་པའོ།
en: The third subsection is where bodhisattvas think, “The minds of these beings have been distorted for a long time by the fourfold erroneous perception of permanence… happiness… pleasant… and self, so I will turn them back from that.”

source: །སེམས་ཅན་འདི་དག་ནི་ཡུན་རིང་པོ་ནས། སེམས་ཅན་དུ་རྣམ་པར་རྟོག་པ་དང་། གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་སུ་རྣམ་པར་རྟོག་པ་ལ་སྤྱོད་སྤྱོད་པ་དག་སྟེ། དེ་དག་གི་དོན་དུ་བདག་གིས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སྟོང་པ་ཉིད་ཀྱི་ཆོས་བཤད་པར་བྱའོ་ཞེས་བྱ་བ་ནི་བཞི་པའོ།
en: The fourth is where they think, “For a long time these beings have been practicing a practice while falsely imagining a being, and while falsely imagining the dharmas, form and so on, so, having fully awakened, I will explain the doctrine of emptiness for their sake.”

source: །སེམས་ཅན་འདི་དག་ནི་ཡུན་རིང་པོ་ནས་མཚན་མ་ལ་སྤྱོད་སྤྱོད་པ་བུད་མེད་དང་། སྐྱེས་པ་ལ་སོགས་པའི་མཚན་མ་དང་། གཟུགས་ལ་སོགས་པ་ཆོས་རྣམས་ཀྱི་མཚན་མ་དག་ལ་སྤྱོད་སྤྱོད་པ་དག་སྟེ། དེ་དག་གི་དོན་དུ་བདག་གིས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། མཚན་མ་མེད་པའི་ཆོས་བཤད་པར་བྱའོ་ཞེས་བྱ་བ་ནི་ལྔ་པའོ། །དེ་བཞིན་དུ་སེམས་ཅན་འདི་དག་ནི་ཡུན་རིང་པོ་ནས་སྨོན་ལམ་ལ་སྤྱོད་སྤྱོད་པ།
en: The fifth is, “For a long time these beings have been practicing a practice with causal signs—the causal sign for a woman, for a man, and so on—so, having fully awakened, I will explain the doctrine of signlessness for their sake.”

source: བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ལ་སོགས་པའི་དོན་དང་། གཟུགས་བཟང་པོ་ལ་སོགས་པའི་ཆོས་རྣམས་ཀྱི་དོན་དུ་སྨོན་ལམ་འདེབས་པ་དག་སྟེ། དེ་དག་གི་དོན་དུ་བདག་གིས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སྨོན་པ་མེད་པའི་ཆོས་བཤད་པར་བྱའོ་ཞེས་བྱ་བ་ནི་དྲུག་པའོ།
en: Similarly, the sixth is, “For a long time these beings have been practicing a practice while making wishes, and making prayers so it will lead to the dharmas of wealth and the beautiful body of “Śatakratu, Brahmā, a world protector,” and so on, so, having fully awakened, I will explain the doctrine of wishlessness for their sake.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ལ་དྲི་བ་ལ་ཡང་། གལ་ཏེ་དེ་དག་གིས་དེ་སྐད་དྲིས་པ་ལ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། དངོས་པོ་མེད་པ་དག །དེ་ལྟར་ཁྱོད་ཀྱིས་ལེགས་པར་བསྒོམ་པར་བྱའོ་ཞེས་དེ་དག་ཉིད་བཟུང་ནས་ལན་འདེབས་ན།
en: Also, in regard to asking bodhisattvas, if when asked they respond, “They must meditate well on emptiness… signlessness… wishlessness… not occasioning anything, nonproduction, and the absence of an existent thing,” taking just those as their point of departure, they should know they will have been prophesied because they will have realized well the mark of the knowledge of mastery.

source: ལུང་བསྟན་པ་ཡིན་ནོ་ཞེས་བྱ་བར་རིག་པར་བྱ་སྟེ། ཡོངས་སུ་འདྲིས་པ་ཤེས་པའི་མཚན་ཉིད་རབ་ཏུ་རྟོགས་པའི་ཕྱིར་རོ། །གལ་ཏེ་དེ་དག་གིས་དེ་སྐད་དུ་དྲིས་པ་ལ་སྟོང་པ་ཉིད་སྒོམ་པ་ལ་སོགས་པ་སྤོང་ཞིང་། དེ་དག་བསྒོམ་པར་མི་བྱ་སྟེ། དེ་དག་མཐོང་ལ་རྣམ་པ་གཞན་དུ་མི་རྟག་པ་ལ་སོགས་པར་བསྒོམ་པར་བྱའོ་ཞེས་ལན་འདེབས་ན།
en: But if, when asked, they respond, “They should reject the meditation on emptiness, and so on, they should not meditate on them, they should cast them away and cultivate impermanence and so on instead,” up to they should know they have not been prophesied.

source: ལུང་བསྟན་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བར་རིག་པར་བྱའོ། །དེ་ལྟར་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔས་ཕྱིར་མི་ལྡོག་པའི་ས་ནོན་པ་ལྟར་ཞེས་བྱ་བ་ནི་ཇི་ལྟར་ས་བརྒྱད་པ་ཐོབ་པ་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཏེ།
en: They “are not like irreversible bodhisattvas who… have stepped onto the irreversible level.”

source: ས་བརྒྱད་པ་ཐོབ་པ་དེ་བཞིན་དུ་དེ་དག་ལེགས་པར་ཡོངས་སུ་འདྲིས་པར་བྱས་ནས་བསྲབས་པའི་ས་ནོན་པ་མ་ཡིན་ཏེ།
en: Those without mastery do not, like those who have reached the eighth level, “having achieved mastery” of them, “passing beyond the Tanū level,” become irreversible.

source: དེ་ཙམ་དུ་ཡོངས་སུ་སྨིན་པ་མ་ཡིན་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means that they are not fully matured just through that.

source: །ས་གཉིས་པ་ནས་བཟུང་ནས་ས་བདུན་པའི་བར་ནི་བསྲབས་པའི་སའོ།
en: The “Tanū level” is from the second up to the seventh level. “

source: །བཅོམ་ལྡན་འདས་གང་གིས་སླར་མི་ལྡོག་པར་འགྱུར་བའི་རྣམ་གྲངས་མཆིས་སམ་ཞེས་བྱ་བ་ནི་གལ་ཏེ།
en: Would there then, Lord, be ways in which [they] would be irreversible from awakening?”

source: དེ་ཕྱིར་མི་ལྡོག་པའི་ས་བརྒྱད་པ་མ་ཐོབ་ཀྱང་། ལེགས་པར་ཡོངས་སུ་འདྲིས་པར་བྱས་ནས་ཕྱིར་མི་ལྡོག་པའི་ལན་ལྡོན་ན། ཕྱིར་མི་ལྡོག་པའི་མཚན་ཉིད་དང་ལྡན་པའི་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རམ་ཞེས་བསྟན་པའོ། །ཡོངས་སུ་སྦྱོང་བར་བགྱིས་པའི་སའམ།
en: It is teaching this: if they, even without having reached the eighth level where they are irreversible from awakening, having excellently achieved mastery, deliver the response of an irreversible bodhisattva, would they become irreversible because of meeting the definition of those irreversible from awakening? “

source: ཡོངས་སུ་སྦྱོང་བ་བགྱིད་པ་མ་ལགས་པའི་ས་ཡང་མི་མངོན་ཏེ་ཞེས་བྱ་བ་ནི་ས་འོག་མ་རྣམས་བསྟན་པའོ།
en: Levels that they have cleansed or levels that they are cleansing do not appear” teaches the lower levels. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ནི་ཉུང་ངོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་མང་དུ་ཟིན་ཀྱང་། འདི་ལྟར་ས་བརྒྱད་པ་མ་ཐོབ་ཀྱང་ཡོངས་སུ་འདྲིས་པ་ལེགས་པར་བསྒོམས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་མི་ལྡོག་པའི་ལན་ལྡོན་པར་འགྱུར་བ་དེ་དག་ནི་ཉུང་ངོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །ཡོངས་སུ་སྦྱོང་བའི་ས་ཡང་རུང་།
en: Those bodhisattva great beings… are few” means that even though “bodhisattvas who practice for awakening are many,” those who will give the answer of an irreversible bodhisattva who has excellently developed mastery, even without having reached the eighth level, “are few.” “

source: ཡོངས་སུ་སྦྱོང་བ་མ་ཡིན་པའི་ས་ཡང་རུང་ཞེས་བྱ་བ་ནི་ས་འོག་མ་རྣམས་བསྟན་པའོ།
en: Whether they are levels that have been cleansed or whether they are levels that have not been cleansed” teaches the lower levels.

source: །དེ་ནས་ཡང་བར་སྐབས་ནས་བྱུང་བ་ཕྱིར་མི་ལྡོག་པའི་མཚན་ཉིད་དང་བདུད་ཀྱི་ལས་རྣམས་དང་། དགེ་བའི་བཤེས་གཉེན་རྣམས་ཀྱང་གོ་སླའོ།
en: Then, the marks of irreversibility, the works of Māra, and spiritual friends occurring in this section of the text are again easy to understand.

source: །རབ་འབྱོར་ནམ་མཁའ་ལྟར་ཆགས་པ་མེད་པའི་མཚན་ཉིད་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ་ཞེས་བྱ་བ་ནི་ནམ་མཁའ་བཞིན་དུ་ཐོགས་པ་མེད་པའི་མཚན་ཉིད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Questions 18 to 27 “Subhūti, the perfection of wisdom is like space, unimpeded.” This means it is characterized as unimpeded like space.

source: །སྔར་ནི་བདུད་ཀྱི་ལས་ལ་སོགས་པས་ཐོགས་པ་དང་བཅས་པ་བསྟན་ཏོ།
en: Earlier the explanation was of the perfection of wisdom impeded by the works of Māra and so on.

source: །དེ་ནི་རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་མཚན་ཉིད་མེད་པ་སྟེ།
en: Now, “Subhūti, the perfection of wisdom is without a mark.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མཚན་ཉིད་གང་ཡང་མེད་དོ་ཞེས་བྱ་བས་ཐོགས་པ་མེད་པའི་མཚན་ཉིད་བཀའ་སྩལ་ཏེ།
en: The perfection of wisdom’s mark does not exist at all” says that it is marked as unimpeded.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གཞན་གང་གི་མཚན་ཉིད་ཀྱང་མ་ཡིན་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མཚན་ཉིད་ཀྱང་ཅི་ཡང་ཡོད་པ་མ་ཡིན་ཏེ།
en: The perfection of wisdom is not the mark of anything else, and the mark of the perfection of wisdom is also not anything at all.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་མ་ཡིན་ནོ་ཞེས་སྟོན་ཏོ།
en: This is teaching that it is not an entity that is a nonexistent thing. “

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་དབེན་པ། ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་སྟོང་པའོ་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པའི་ཆོས་རྣམས་ཀྱིས་དབེན་ཞིང་བྲལ་བ་ནི་ཡོངས་སུ་གྲུབ་པ་སྟེ།
en: Subhūti… all phenomena are isolated from an intrinsic nature, all phenomena are empty of an intrinsic nature.”

source: ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་དོ།
en: The thoroughly established—the intrinsic nature of all phenomena—is isolated from and separated from all falsely imagined phenomena.

source: །དེ་བས་ན་དེ་དག་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་ངོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Therefore, it means they “all are empty of the intrinsic nature.” “

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་ནི་ཆོས་ཐམས་ཅད་ཀྱིས་དབེན་ལ། ཆོས་ཐམས་ཅད་ནི་ཆོས་ཐམས་ཅད་ཀྱིས་སྟོང་ན། བཅོམ་ལྡན་འདས་སེམས་ཅན་རྣམས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པ་དང་རྣམ་པར་བྱང་བ་ཇི་ལྟར་མཆིས་པར་འགྱུར་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་ཞུས་ཏེ།
en: Lord, if all phenomena are isolated from all phenomena, and if all phenomena are empty of all phenomena, Lord, how could there be the defilement and purification of beings?”

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ལ་སྟོང་ན་ཕྱིས་དབེན་པར་བྱར་ཡང་མེད་ལ་སྟོང་པར་བྱར་ཡང་མེད་དེ། དེ་ལྟར་གྱུར་ན་དབེན་པ་དང་སྟོང་པ་དེ་དག་ཇི་ལྟར་ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར། ཇི་ལྟར་ཡང་རྣམ་པར་བྱང་བར་འགྱུར་ཞེས་ཞུས་པའོ།
en: and so on is asking: “Lord, if all phenomena are isolated from and empty of an intrinsic nature, later there will be nothing to be isolated from and nothing to be empty of, and if that is the case how will those—the isolated and empty—be defiled, and how will they be purified?”

source: །དེ་སྐད་ཅེས་ཞུས་པ་དང་། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། སེམས་ཅན་འདི་དག་ཡུན་རིང་པོ་ནས་ངར་འཛིན་པ་དང་ང་ཡིར་འཛིན་པ་ལ་སྤྱོད་དམ་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་བསྟན་ཏེ།
en: Having asked that, “What do you think, Subhūti, do beings go on grasping at ‘I’ and grasping at ‘mine’ for a long time?”

source: ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ཞིང་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་དུ་ཟིན་ཀྱང་། བྱིས་པ་རྣམས་དེ་དག་དབེན་པ་དང་། སྟོང་པ་ཉིད་དུ་མི་ཤེས་ཏེ།
en: and so on, teaches the following: Even though all phenomena are already isolated from an intrinsic nature and empty of an intrinsic nature, simple folk do not know that they are just isolated and empty.

source: དེ་དག་གིས་མི་ཤེས་པའི་ཉེས་པས་ཕུང་པོ་ལྔ་ལ་སོགས་པའི་ཆོས་རྣམས་ལ། ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པས་ཆགས་པར་འགྱུར། ཆགས་པས་བསོད་ནམས་དང་། བསོད་ནམས་མ་ཡིན་པ་ལ་སོགས་པ་མངོན་པར་འདུ་བྱེད་པ་རྩོམ་མོ།
en: On account of the fault of not knowing, they become attached to phenomena—the aggregates and so on—through grasping at them as “I” and grasping at them as “mine,” and because of that attachment they undertake actions that are good and bad and so on.

source: །དེའི་དབང་གིས་སེམས་ཅན་རྣམས་འཁོར་བར་མཚམས་སྦྱོར་ཞིང་འཁོར་ཏེ། ཉོན་མོངས་པའི་ཀུན་ནས་ཉོན་མོངས་པ་དང་། ལས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པས་ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར་ཏེ།
en: Governed by that, beings link up with and pass through cycles of existence, becoming defiled by afflictive defilement and karmic defilement.

source: དེ་ལྟར་མི་ཤེས་པའི་ཉེས་པས་ཀུན་ནས་ཉོན་མོངས་པ་ཡོད་པར་འགྱུར་རོ།
en: Thus, there is defilement on account of the fault of not knowing.

source: །དེ་དག་ཀྱང་ཕྱིས་གང་གི་ཚེ་དགེ་བའི་བཤེས་གཉེན་རྙེད་ནས་མཉན་པ་དང་། བསམས་པ་ལ་སོགས་པའི་དབང་གིས། དབེན་པའི་མཚན་ཉིད་སྟོང་པའི་མཚན་ཉིད་རྟོགས་པར་འགྱུར་བ་དེའི་ཚེ།
en: Later, when they have again found spiritual friends, based on having listened and reflected and so on they realize the mark of the isolated and the mark of the empty.

source: ཇི་སྐད་སྨོས་པའི་ཀུན་ནས་ཉོན་མོངས་པ་མི་སྐྱེ་བའི་ཕྱིར་རིམ་གྱིས་ཀུན་བརྟགས་པའི་ཆོས་རྣམས་ཡོངས་སུ་བཟློག་པས་རྣམ་པར་བྱང་བ་ཡང་ཡོད་པར་འགྱུར་རོ།
en: Then the aforementioned defilement does not arise and gradually, through putting a stop to the imaginary dharmas, there is purification.
